#1 Опера́тор ветвле́ния — оператор, конструкция языка программирования, обеспечивающая выполнение определённой команды (набора команд) только при условии истинности некоторого логического выражения, либо выполнение одной из нескольких команд (наборов команд) в зависимости от значения некоторого выражения. 
'''
tovar1 = 50
tovar2 = 32
if tovar1 + tovar2 > 99 :
    print("99 рублей недостаточно")
else:
    print("Чек оплачен")
'''
#2 https://pythonru.com/osnovy/cikl-for-in

#3

#3

#4

#5

#6

#7

#8

#9
a = int(input("Введите натуральное число a: "))
if (((a / int(1000)) + ((a % int(1000)) / int(100))) == (((a % int(100)) / int(10)) + (a % int(10)))):
	print("true")
else:
	print("false")
#10

#11

#12

#13

#14

#15

#16

#17

#18

#19

#20

#21

#22

#23

#24

#25

